---
kind: type
id: T:Autodesk.Revit.DB.AnalyzesAsType
source: html/c273e69a-8851-6f15-dc90-2385359e3c45.htm
---
# Autodesk.Revit.DB.AnalyzesAsType

This enum class is used for the BuiltInParameter STRUCTURAL_ANALYZES_AS.

## Syntax (C#)
```csharp
public enum AnalyzesAsType
```